#Sequencing – კოდი სრულდება ზემოდან ქვემოთ
#Iteration – კოდის გამეორება
#Selection – არჩევა თუ რომელი კოდი უნდა შესრულდეს
#Algorithm – არის ნაბიჯ-ნაბიჯ გაწერილი ინსტრუქცია
print(                                                )
#Algorithm – არის ნაბიჯ-ნაბიჯ გაწერილი ინსტრუქცია
print(                                        )
#Sequencing – კოდი სრულდება ზემოდან ქვემოთ
#loop-ი ამეორებს კოდს მაგალითად
for i in range(10):
    print("alex")
print(                       )
for i in range(10):
    print(i)
#for i in range(10)ეს რიცხვი აღმიშნავს რამდენჯერ გამეორდება კოდი
#                ^
#for i in range(12,15):ორი რიცხვი თუ არის ლუუპში მაშინ პირველი აღნიშნავს რომელი რიცხვიდან დაიწყებს ათვლას მეორე კი სადამდე თვლა იქნება
#for i in range(12,15,2)ორი რიცხვი თუ არის ლუუპში მაშინ პირველი აღნიშნავს რომელი რიცხვიდან დაიწყებს ათვლას მეორე კი სადამდე თვლა იქნება მესამე კი რამდენს გამოტოვებს
print(                                 )
for i in range(15):
    print('ხორცის სალათი')
print(                                 )
for i in range(15):
    print('40')