i = 0

while i < 30:
    print(i)
    i = i + 1
print(                           )
for i in range(30):
    print(i)
print(                                       )
#while loop და for loop განსხვავდება ასე, ძალიან მარტივად

#while loop

#მუშაობს მანამდე, სანამ პირობა არის True
#ზუსტად არ იცის რამდენჯერ შესრულდება
#ხშირად გამოიყენება, როცა რაოდენობა წინასწარ არ ვიცით

#მაგალითად: „გაიმეორე სანამ რაღაც მოხდება“

#for loop

#მუშაობს განსაზღვრული რაოდენობის ჯერ
#წინასწარ ვიცით რამდენჯერ შესრულდება
#გამოიყენება სიებზე, რიცხვებზე, range-ზე

#მაგალითად: „გაიმეორე 10-ჯერ“
print(            )
i = 5

while i < 50:
    print(i)
    i = i + 1